       IDENTIFICATION DIVISION.
       program-id. HelloW.
       AUTHOR. Jecko.
       procedure division.
           DISPLAY "Bienvenue cher Coboliste".
 
      *Ceci est un commentaire
      *     
      
       
