       IDENTIFICATION DIVISION.
       program-id. HelloW.
       AUTHOR. Jeck0v.
       procedure division.
           DISPLAY "HelloWorld".
 
      *Ceci est un commentaire
      *     
      
       
