000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. PERSON-INFO.
000300 DATA DIVISION.
000400 WORKING-STORAGE SECTION.
000500 77 PERSON-NAME PIC X(30).
000600 77 PERSON-FIRSTNAME PIC X(30).
000700 77 PERSON-AGE PIC 99.
000800 PROCEDURE DIVISION.
000900   DISPLAY 'Enter Name: '.
001000   ACCEPT PERSON-NAME.  
      * ACCEPT permet à l'utilisateur de saisir une valeur 
001100   DISPLAY 'Enter First Name: '.
001200   ACCEPT PERSON-FIRSTNAME.  
001300   DISPLAY 'Enter Age: '.
001400   ACCEPT PERSON-AGE.
001500   DISPLAY 'Name: ' PERSON-NAME.
001600   DISPLAY 'First Name: ' PERSON-FIRSTNAME.
001700   DISPLAY 'Age: ' PERSON-AGE.
001800   STOP RUN.
