000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. PERSON-INFO.
000300 DATA DIVISION.
000400 WORKING-STORAGE SECTION.
000500 77 PERSON-NAME PIC X(30) VALUE 'Doe'.
000600 77 PERSON-FIRSTNAME PIC X(30) VALUE 'John'.
000700 77 PERSON-AGE PIC 99 VALUE 22.
000800 PROCEDURE DIVISION.
000900   DISPLAY 'Nom: ' PERSON-NAME.
001000   DISPLAY 'Prénom: ' PERSON-FIRSTNAME.
001100   DISPLAY 'Age: ' PERSON-AGE.
001200   STOP RUN.
